/* Search criteria for other date properties of a file, such as when a photograph was taken, within a specific period before today */
"%@ %[Any Date]@" = "%1$@ %2$[Любая дата]@";
"%@ %[Today]@" = "%1$@ %2$[Сегодня]@";
"%@ %[Since Yesterday]@" = "%1$@ %2$[Со вчерашн. дня]@";
"%@ %[This week]@" = "%1$@ %2$[На этой нед.]@";
"%@ %[Within Last 2 weeks]@" = "%1$@ %2$[За последн. 2 нед.]@";
"%@ %[This month]@" = "%1$@ %2$[В этом мес.]@";
"%@ %[Within Last 2 months]@" = "%1$@ %2$[За последн. 2 мес.]@";

/* Search criteria for other boolean properties of a file, such as whether red-eye correction was on */
"%@ %[Any]@" = "%1$@ %2$[Люб.]@";
"%@ %[Yes]@" = "%1$@ %2$[Да]@";
"%@ %[No]@" = "%1$@ %2$[Нет]@";

/* Search criteria for other string properties of a file, such as the name of the author */
"%@ %[Contains]@ %@" = "%1$@ %2$[Содержит]@ %3$@";
"%@ %[Begins With]@ %@" = "%1$@ %2$[Нач. с]@ %3$@";
"%@ %[Ends With]@ %@" = "%1$@ %2$[Оканч. на]@ %3$@";
"%@ %[Is]@ %@" = "%1$@ %2$[Совпадает с]@ %3$@";

/* Search criteria for other date properties of a file, such as when a photograph was taken, on a specific date */
"%@ %[Exactly]@ %@" = "%1$@ %2$[Точно]@ %3$@";
"%@ %[Before]@ %@" = "%1$@ %2$[До]@ %3$@";
"%@ %[After]@ %@" = "%1$@ %2$[После]@ %3$@";

/* Search criteria for other numerical properties of a file, such as the pixel height of an image */
"%@ %[Greater than]@ %@" = "%1$@ %2$[Больше чем]@ %3$@";
"%@ %[Less than]@ %@" = "%1$@ %2$[Меньше чем]@ %3$@";

/* Search criteria for other date properties of a file, such as when a photograph was taken, within a user-specified period of time before today */
"%@ %[Within Last]@ %@ %[Days]@" = "%1$@ %2$[За последн.]@ %3$@ %4$[Дн.]@";
"%@ %[Within Last]@ %@ %[Weeks]@" = "%1$@ %2$[За последн.]@ %3$@ %4$[нед.]@";
"%@ %[Within Last]@ %@ %[Months]@" = "%1$@ %2$[За последн.]@ %3$@ %4$[мес.]@";
"%@ %[Within Last]@ %@ %[Years]@" = "%1$@ %2$[За последн.]@ %3$@ %4$[года(лет)]@";

/* Search criteria for other color space properties of a file */
"%[Color Space]@ %[Any Color Space]@" = "%1$[Цветовое пространство]@ %2$[Любое цветовое пространство]@";
"%[Color Space]@ %[RGB]@" = "%1$[Цветовое пространство]@ %2$[RGB]@";
"%[Color Space]@ %[CMYK]@" = "%1$[Цветовое пространство]@ %2$[CMYK]@";
"%[Color Space]@ %[Grayscale]@" = "%1$[Цветовое пространство]@ %2$[Оттенки серого]@";

/* Search criteria for files by contents */
"%[Contents]@ contain %@" = "%1$[Содержимое]@ содержит %2$@";

/* Search criteria for time duration - minutes and seconds */
"%[Duration]@ %[Greater than]@ %@ %[min]@ %@ %[sec]@" = "%1$[Длительность]@ %2$[Больше чем]@ %3$@ %4$[мин.]@ %5$@ %6$[сек.]@";
"%[Duration]@ %[Less than]@ %@ %[min]@ %@ %[sec]@" = "%1$[Длительность]@ %2$[Меньше чем]@ %3$@ %4$[мин.]@ %5$@ %6$[сек.]@";

/* Search criteria for files by keyword */
"%[Keywords]@ %@" = "%1$[Ключевые слова]@ %2$@";

/* Search criteria for files by keyword containing */
"%[Keywords]@ contain %@" = "%1$[Ключевые слова]@ содержат %2$@";

/* Search criteria for specific kinds of files */
"%[Kind]@ is %[Any]@" = "%1$[Тип]@ – %2$[Любой]@";
"%[Kind]@ is %[Images]@" = "%1$[Тип]@ – %2$[Изображения]@";
"%[Kind]@ is %[Text]@" = "%1$[Тип]@ – %2$[Текст]@";
"%[Kind]@ is %[PDF]@" = "%1$[Тип]@ – %2$[PDF]@";
"%[Kind]@ is %[Movies]@" = "%1$[Тип]@ – %2$[Фильмы]@";
"%[Kind]@ is %[Music]@" = "%1$[Тип]@ – %2$[Музыка]@";
"%[Kind]@ is %[Documents]@" = "%1$[Тип]@ – %2$[Документы]@";
"%[Kind]@ is %[Presentations]@" = "%1$[Тип]@ – %2$[Презентации]@";
"%[Kind]@ is %[Folders]@" = "%1$[Тип]@ – %2$[Папки]@";
"%[Kind]@ is %[Applications]@" = "%1$[Тип]@ – %2$[Программы]@";

/* Search criteria for other kinds of files */
"%[Kind]@ is %[Others...]@ %@" = "%1$[Тип]@ – %2$[Другое...]@ %3$@";

/* Search criteria for files by a particular label (color) */
"%[Label]@ is %@" = "%1$[Этикетка]@ – %2$@";

/* Search criteria for dates a fixed amount relative to today */
"%[Last Opened]@ %[Any Date]@" = "%1$[Последн. откр.]@ %2$[Люб. Дата]@";
"%[Last Modified]@ %[Any Date]@" = "%1$[Последн. изменен.]@ %2$[Любая дата]@";
"%[Created]@ %[Any Date]@" = "%1$[Создано]@ %2$[Люб. дата]@";
"%[Last Opened]@ %[Today]@" = "%1$[Последн. откр.]@ %2$[Сегодня]@";
"%[Last Modified]@ %[Today]@" = "%1$[Последн. изменен.]@ %2$[Сегодня]@";
"%[Created]@ %[Today]@" = "%1$[Создано]@ %2$[Сегодня]@";
"%[Last Opened]@ %[Since Yesterday]@" = "%1$[Последн. откр.]@ %2$[Со вчерашн. дня]@";
"%[Last Modified]@ %[Since Yesterday]@" = "%1$[Последн. изменен.]@ %2$[Со вчерашн. дня]@";
"%[Created]@ %[Since Yesterday]@" = "%1$[Создано]@ %2$[Со вчерашн. дня]@";
"%[Last Opened]@ %[This week]@" = "%1$[Последн. откр.]@ %2$[На этой нед.]@";
"%[Last Modified]@ %[This week]@" = "%1$[Последн. изменен.]@ %2$[На этой нед.]@";
"%[Created]@ %[This week]@" = "%1$[Создано]@ %2$[На этой нед.]@";
"%[Last Opened]@ %[Within Last 2 weeks]@" = "%1$[Последн. откр.]@ %2$[За последн. 2 нед.]@";
"%[Last Modified]@ %[Within Last 2 weeks]@" = "%1$[Последн. изменен.]@ %2$[За последн. 2 нед.]@";
"%[Created]@ %[Within Last 2 weeks]@" = "%1$[Создано]@ %2$[За последн. 2 нед.]@";
"%[Last Opened]@ %[This month]@" = "%1$[Последн. откр.]@ %2$[В этом мес.]@";
"%[Last Modified]@ %[This month]@" = "%1$[Последн. изменен.]@ %2$[В этом мес.]@";
"%[Created]@ %[This month]@" = "%1$[Создано]@ %2$[В этом мес.]@";
"%[Last Opened]@ %[Within Last 2 months]@" = "%1$[Последн. откр.]@ %2$[За последн. 2 мес.]@";
"%[Last Modified]@ %[Within Last 2 months]@" = "%1$[Последн. изменен.]@ %2$[За последн. 2 мес.]@";
"%[Created]@ %[Within Last 2 months]@" = "%1$[Создано]@ %2$[За последн. 2 мес.]@";

/* Search criteria for specific dates */
"%[Last Opened]@ %[Exactly]@ %@" = "%1$[Последн. откр.]@ %2$[Точно]@ %3$@";
"%[Last Modified]@ %[Exactly]@ %@" = "%1$[Последн. изменен.]@ %2$[Точно]@ %3$@";
"%[Created]@ %[Exactly]@ %@" = "%1$[Создано]@ %2$[Точно]@ %3$@";
"%[Last Opened]@ %[Before]@ %@" = "%1$[Последн. откр.]@ %2$[До]@ %3$@";
"%[Last Modified]@ %[Before]@ %@" = "%1$[Последн. изменен.]@ %2$[До]@ %3$@";
"%[Created]@ %[Before]@ %@" = "%1$[Создано]@ %2$[До]@ %3$@";
"%[Last Opened]@ %[After]@ %@" = "%1$[Последн. откр.]@ %2$[После]@ %3$@";
"%[Last Modified]@ %[After]@ %@" = "%1$[Последн. изменен.]@ %2$[После]@ %3$@";
"%[Created]@ %[After]@ %@" = "%1$[Создано]@ %2$[После]@ %3$@";

/* Search criteria for dates a variable amount relative to today */
"%[Last Opened]@ %[Within Last]@ %@ %[Days]@" = "%1$[Последн. откр.]@ %2$[За последн.]@ %3$@ %4$[Дн.]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Days]@" = "%1$[Последн. изменен.]@ %2$[За последн.]@ %3$@ %4$[Дн.]@";
"%[Created]@ %[Within Last]@ %@ %[Days]@" = "%1$[Создано]@ %2$[За последн.]@ %3$@ %4$[Дн.]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Последн. откр.]@ %2$[За последн.]@ %3$@ %4$[Нед.]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Последн. изменен.]@ %2$[За последн.]@ %3$@ %4$[Нед.]@";
"%[Created]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Создано]@ %2$[За последн.]@ %3$@ %4$[Нед.]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Months]@" = "%1$[Последн. откр.]@ %2$[За последн.]@ %3$@ %4$[Мес.]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Months]@" = "%1$[Последн. изменен.]@ %2$[За последн.]@ %3$@ %4$[Мес.]@";
"%[Created]@ %[Within Last]@ %@ %[Months]@" = "%1$[Создано]@ %2$[За последн.]@ %3$@ %4$[Мес.]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Years]@" = "%1$[Последн. откр.]@ %2$[За последн.]@ %3$@ %4$[Г.]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Years]@" = "%1$[Последн. изменен.]@ %2$[За последн.]@ %3$@ %4$[Г.]@";
"%[Created]@ %[Within Last]@ %@ %[Years]@" = "%1$[Создано]@ %2$[За последн.]@ %3$@ %4$[Г.]@";

/* Search criteria for musical genre type */
"%[Musical genre]@ %@" = "%1$[Музыкальный жанр]@ %2$@";

/* Search criteria for name extension type */
"%[Name Extension]@ %@" = "%1$[Расширение имени]@ %2$@";

/* Search criteria for files by name */
"%[Name]@ %[Contains]@ %@" = "%1$[Имя]@ %2$[Содержит]@ %3$@";
"%[Name]@ %[Begins With]@ %@" = "%1$[Имя]@ %2$[Нач. с]@ %3$@";
"%[Name]@ %[Ends With]@ %@" = "%1$[Имя]@ %2$[Оканч. на]@ %3$@";
"%[Name]@ %[Is]@ %@" = "%1$[Имя]@ %2$[-]@ %3$@";

/* Search criteria for other color space properties of a file */
"%[Orientation]@ %[Any Orientation]@" = "%1$[Ориентация]@ %2$[Любая ориентация]@";
"%[Orientation]@ %[Landscape]@" = "%1$[Ориентация]@ %2$[Ландшафт]@";
"%[Orientation]@ %[Portrait]@" = "%1$[Ориентация]@ %2$[Портрет]@";

/* Menu item to bring up an additional list of search criteria */
"%[Other...]@" = "%[Другое...]@";

/* Search criteria for raw query type */
"%[Raw query]@ %@" = "%1$[Запрос необработанных данных]@ %2$@";

/* Search criteria for generic search-by-all-fields type */
"%[Search for]@ %@" = "%1$[Выполнить поиск]@ %2$@";

/* Search criteria for files larger or smaller than a specific number of kilobytes, megabytes, or gigabytes */
"%[Size]@ %[Greater than]@ %@ %[KB]@" = "%1$[Размер]@ %2$[Больше]@ %3$@ %4$[КБ]@";
"%[Size]@ %[Less than]@ %@ %[KB]@" = "%1$[Размер]@ %2$[Меньше]@ %3$@ %4$[КБ]@";
"%[Size]@ %[Greater than]@ %@ %[MB]@" = "%1$[Размер]@ %2$[Больше]@ %3$@ %4$[МБ]@";
"%[Size]@ %[Less than]@ %@ %[MB]@" = "%1$[Размер]@ %2$[Меньше]@ %3$@ %4$[МБ]@";
"%[Size]@ %[Greater than]@ %@ %[GB]@" = "%1$[Размер]@ %2$[Больше]@ %3$@ %4$[ГБ]@";
"%[Size]@ %[Less than]@ %@ %[GB]@" = "%1$[Размер]@ %2$[Меньше]@ %3$@ %4$[ГБ]@";

/* Search criteria for other visibility properties of a file */
"%[Visibility]@ %[Visible or Invisible]@" = "%1$[Видимость]@ %2$[Видимые или невидимые]@";
"%[Visibility]@ %[Visible Items]@" = "%1$[Видимость]@ %2$[Видимые объекты]@";
"%[Visibility]@ %[Invisible Items]@" = "%1$[Видимость]@ %2$[Невидимые объекты]@";

